app/Controllers/Admin/DashboardController.php

DELETE FROM `users`
WHERE `id` = '46'
AND `id` IN ('46')
---
    public function deleteuser()
    {
         $id = $this->request->getVar('id_user');
        $userModel = new Login_model();
        $data['user'] = $userModel->where('id', $id)->delete($id);

SELECT *
FROM `users`
---
     public function getdatauserpost()
    {
         $usersModel = new Login_model();
         $des =   $data['data'] = $usersModel->findAll();