app/Controllers/Admin/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'fajarocta40@gmail.com'
 LIMIT 1
---
     public function loginAuth(){
        $usersModel = new Login_model();
		$email = $this->request->getPost('email');
	    $password = md5($this->request->getPost('password'));
	    $user = $usersModel->where('email', $email)->first();